{
  "Population Data by Indian Census": "<p>The population of India, as recorded by the decennial censuses conducted since 1872, reflects significant growth over time, with the exception of a decline between 1911 and 1921. Below is a detailed compilation of India's population by decade, based on available census data, presented in a clear and structured manner. Note that the census data prior to 1951 includes regions that are now part of Pakistan and Bangladesh, as these were part of British India. Post-1947, the data pertains to the Republic of India.</p><p><br></p><h3>Population of India by Census (1872–2011)</h3><p>The following table lists the population of India as recorded in each decennial census, starting from the first comprehensive census in 1881, with earlier non-synchronous data for 1872. Where exact figures are available, they are provided; otherwise, approximate figures are noted based on reliable sources.</p><p><br></p><table><tbody><tr><td data-row=\"1\"><strong>Census Year Population (in millions)</strong></td></tr><tr><td data-row=\"2\">1872</td><td data-row=\"2\">~206.2</td><td data-row=\"2\">First non-synchronous census, conducted under British rule. Data incomplete due to limited coverage.</td></tr><tr><td data-row=\"3\">1881</td><td data-row=\"3\">253.9</td><td data-row=\"3\">First synchronous census, covering most of British India (excluding some regions like Kashmir).</td></tr><tr><td data-row=\"4\">1891</td><td data-row=\"4\">287.3</td><td data-row=\"4\">Continued growth, with improved coverage.</td></tr><tr><td data-row=\"5\">1901</td><td data-row=\"5\">238.4</td><td data-row=\"5\">Population reflects British India, including modern-day Pakistan and Bangladesh. Slight decline from 1891 due to famines and epidemics.</td></tr><tr><td data-row=\"6\">1911</td><td data-row=\"6\">252.1</td><td data-row=\"6\">Marginal growth; affected by administrative challenges and epidemics.</td></tr><tr><td data-row=\"7\">1921</td><td data-row=\"7\">251.3</td><td data-row=\"7\">Only decade with a population decline (-0.31%), due to the 1918 flu pandemic, which killed at least 12 million. Known as the \"Year of the Great Divide.\"</td></tr><tr><td data-row=\"8\">1931</td><td data-row=\"8\">279.0</td><td data-row=\"8\">Recovery and growth post-1918 pandemic.</td></tr><tr><td data-row=\"9\">1941</td><td data-row=\"9\">318.7</td><td data-row=\"9\">Growth despite challenges of World War II; last census under British rule.</td></tr><tr><td data-row=\"10\">1951</td><td data-row=\"10\">361.1</td><td data-row=\"10\">First census of independent India; population growth rate of 13.31% (1941–51). Excludes Pakistan and Bangladesh post-Partition.</td></tr><tr><td data-row=\"11\">1961</td><td data-row=\"11\">439.2</td><td data-row=\"11\">Growth rate of 21.51%, reflecting post-independence stability.</td></tr><tr><td data-row=\"12\">1971</td><td data-row=\"12\">548.2</td><td data-row=\"12\">Growth rate of 24.80%, one of the highest decadal increases.</td></tr><tr><td data-row=\"13\">1981</td><td data-row=\"13\">683.3</td><td data-row=\"13\">Growth rate of 24.66%, continued rapid expansion.</td></tr><tr><td data-row=\"14\">1991</td><td data-row=\"14\">846.4</td><td data-row=\"14\">Growth rate of 23.87%, slightly lower but still significant.</td></tr><tr><td data-row=\"15\">2001</td><td data-row=\"15\">1,028.7</td><td data-row=\"15\">Growth rate of 21.54%; population crossed 1 billion.</td></tr><tr><td data-row=\"16\">2011</td><td data-row=\"16\">1,210.9</td><td data-row=\"16\">Growth rate of 17.70%, showing a slowdown in growth. Population recorded as 1,210,854,977 (623.7 million males, 586.5 million females).</td></tr></tbody></table><h3><br></h3><h3>Key Observations</h3><ol><li data-list=\"ordered\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Historical Context</strong>: The censuses from 1872 to 1941 were conducted under British rule and included territories that are now Pakistan and Bangladesh. The 1951 census onward reflects the population of independent India, following the Partition in 1947.</li><li data-list=\"ordered\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Population Decline (1911–1921)</strong>: The decade of 1911–21 is notable for a 0.31% population decline, attributed to the 1918 influenza pandemic, which caused significant mortality. This period is referred to as the \"Year of the Great Divide.\" drishtiias.comprb.org</li><li data-list=\"ordered\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Post-Independence Growth</strong>: After 1947, India's population grew rapidly, doubling from 361.1 million in 1951 to 683.3 million in 1981, and reaching 1.21 billion by 2011. The highest decadal growth rates were observed between 1961–71 (24.80%) and 1971–81 (24.66%).en.wikipedia.org</li><li data-list=\"ordered\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Slowing Growth Rate</strong>: The decadal growth rate has been declining since the 1980s, with 2001–2011 recording 17.70%, the lowest since 1921. This reflects improved family planning, education, and healthcare.en.wikipedia.org</li><li data-list=\"ordered\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Recent Estimates</strong>: The 2021 census was postponed due to the COVID-19 pandemic, and the next census is scheduled for 2026–27. Estimates suggest India’s population reached 1.44 billion by 2025, surpassing China.cbc.ca</li><li data-list=\"ordered\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Regional Variations</strong>: States like Uttar Pradesh (199.8 million in 2011) and Bihar (104.1 million in 2011) have driven much of the population growth, while southern states like Kerala and Tamil Nadu have lower fertility rates (1.7–1.8).prb.orgbyjus.com</li></ol><h3><br></h3><h3>Notes on Data</h3><ol><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Sources</strong>: The population figures are primarily drawn from official census data cited in sources such as the Office of the Registrar General &amp; Census Commissioner, India, and secondary analyses from Wikipedia, Pew Research Center, and other reliable references.en.wikipedia.orgknowindia.india.gov.inpewresearch.org</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Post-2011 Estimates</strong>: Since the 2021 census was delayed, recent population figures (e.g., 1.44 billion in 2025) are based on United Nations estimates and Worldometer projections, not official census data. These should be treated as provisional until the 2027 census is completed.@stats_feedcbc.ca</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Challenges in Early Censuses</strong>: Pre-1947 censuses faced issues like incomplete coverage, cultural objections, and lack of house numbering, which may affect the accuracy of earlier data.en.wikipedia.org</li></ol><h3><br></h3><h3>Additional Information</h3><ol><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span>The 2011 census reported a population density of 382 persons per square kilometer, a literacy rate of 74.04%, and a sex ratio of 940 females per 1,000 males.census2011.co.in</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span>The upcoming 2027 census will include caste enumeration for the first time since 1931 and is expected to provide updated demographic insights for policy planning.en.wikipedia.org</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span>For precise data beyond 2011, the 2027 census will be critical, as current estimates vary (e.g., 1.46 billion in 2025 per some sources).@stats_feed</li></ol><p>If you require a visual representation of this data (e.g., a chart showing population growth by decade), please confirm, and I can generate one using available figures. For further details or specific aspects (e.g., state-wise data, fertility rates), please let me know.</p>"
}